# Cleaning of the synop dataset

It can be found here:
https://donneespubliques.meteofrance.fr/?fond=produit&id_produit=90&id_rubrique=32

### Import data:

In [1]:
import pandas as pd

df = pd.read_csv("dataset/synop.2020032009.csv",delimiter=";")
df.head()

,numer_sta,date,pmer,tend,cod_tend,dd,ff,t,td,u,...,nnuage2,ctype2,hnuage2,nnuage3,ctype3,hnuage3,nnuage4,ctype4,hnuage4,Unnamed: 59
0,7005,20200320090000,102520,130,1,50,6.400000,281.450000,279.050000,85,...,mq,mq,mq,mq,mq,mq,mq,mq,mq,NaN
1,7015,20200320090000,102570,120,1,40,5.700000,281.050000,278.150000,82,...,mq,mq,mq,mq,mq,mq,mq,mq,mq,NaN
2,7020,20200320090000,102380,50,1,60,14.500000,281.850000,280.250000,90,...,mq,mq,mq,mq,mq,mq,mq,mq,mq,NaN
3,7027,20200320090000,102310,60,3,60,4.700000,282.250000,281.750000,97,...,mq,mq,mq,mq,mq,mq,mq,mq,mq,NaN
4,7037,20200320090000,102330,70,2,50,6.300000,282.650000,282.050000,96,...,mq,8,mq,mq,mq,mq,mq,mq,mq,NaN

Here is the description of the dataset:
![id station](pictures/doc_parametres_synop_168-1.jpg)
And the id station of Lille
![dataset description](pictures/idstation.png)

In [2]:
df = df[df["numer_sta"] == 7015]
df.head()

,numer_sta,date,pmer,tend,cod_tend,dd,ff,t,td,u,...,nnuage2,ctype2,hnuage2,nnuage3,ctype3,hnuage3,nnuage4,ctype4,hnuage4,Unnamed: 59
1,7015,20200320090000,102570,120,1,40,5.700000,281.050000,278.150000,82,...,mq,mq,mq,mq,mq,mq,mq,mq,mq,NaN

### Selecting features:

In [3]:
interestingFeatures = ["date","pres","dd","ff"]
df = df[interestingFeatures]
df.head()

             date    pres  dd        ff
1  20200320090000  101990  40  5.700000

In [4]:
df.columns = ["date", "pressure","wind_direction","wind_force"]
df.head()

             date pressure wind_direction wind_force
1  20200320090000   101990             40   5.700000

### Cleaning the types of data:

In [5]:
df.dtypes

date               int64
pressure          object
wind_direction    object
wind_force        object
dtype: object

In [6]:
df["pressure"] = df["pressure"].astype(int)
df["wind_direction"] = df["wind_direction"].astype(int)
df["wind_force"] = df["wind_force"].astype(float)
df.dtypes

date                int64
pressure            int32
wind_direction      int32
wind_force        float64
dtype: object

In [7]:
df["date"] = pd.to_datetime(df["date"].astype(str), format='%Y%m%d%H%M%S').astype(str).apply(lambda x: x[0:10])
df.head()

         date  pressure  wind_direction  wind_force
1  2020-03-20    101990              40         5.7